vvpai9/Keil/Keil_v5/ARM/Pack/.Web/SiliconLabs.GeckoPlatform_EFM32LG_DFP.pdsc
      <subFamily DsubFamily="EFM32LG380">
        <book         name="Documents/efm32lg-datasheet.pdf"      title="EFM32LG380 Data Sheet"/>
        <book         name="Documents/efm32lg-errata.pdf"         title="EFM32LG380 Errata"/>
        <!-- *************************  Device 'EFM32LG380F128'  ***************************** -->
        <device Dname="EFM32LG380F128">
          <compile header="Device/SiliconLabs/EFM32LG/Include/em_device.h"  define="EFM32LG380F128"/>
          <debug      svd="SVD/EFM32LG/EFM32LG380F128.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32LG.FLM"  start="0x00000000"  size="0x00020000"  default="1"   style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00020000"  default="0"   style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32LG380F256'  ***************************** -->
        <device Dname="EFM32LG380F256">
          <compile header="Device/SiliconLabs/EFM32LG/Include/em_device.h"  define="EFM32LG380F256"/>
          <debug      svd="SVD/EFM32LG/EFM32LG380F256.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00040000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32LG.FLM"  start="0x00000000"  size="0x00040000"  default="1"   style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00040000"  default="0"   style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32LG380F64'  ***************************** -->
        <device Dname="EFM32LG380F64">
          <compile header="Device/SiliconLabs/EFM32LG/Include/em_device.h"  define="EFM32LG380F64"/>
          <debug      svd="SVD/EFM32LG/EFM32LG380F64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00010000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32LG.FLM"  start="0x00000000"  size="0x00010000"  default="1"   style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00010000"  default="0"   style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFM32LG390">
        <book         name="Documents/efm32lg-datasheet.pdf"      title="EFM32LG390 Data Sheet"/>
        <book         name="Documents/efm32lg-errata.pdf"         title="EFM32LG390 Errata"/>
        <!-- *************************  Device 'EFM32LG390F128'  ***************************** -->
        <device Dname="EFM32LG390F128">
          <compile header="Device/SiliconLabs/EFM32LG/Include/em_device.h"  define="EFM32LG390F128"/>
          <debug      svd="SVD/EFM32LG/EFM32LG390F128.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32LG.FLM"  start="0x00000000"  size="0x00020000"  default="1"   style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00020000"  default="0"   style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32LG390F256'  ***************************** -->
        <device Dname="EFM32LG390F256">
          <compile header="Device/SiliconLabs/EFM32LG/Include/em_device.h"  define="EFM32LG390F256"/>
          <debug      svd="SVD/EFM32LG/EFM32LG390F256.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00040000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32LG.FLM"  start="0x00000000"  size="0x00040000"  default="1"   style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00040000"  default="0"   style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32LG390F64'  ***************************** -->
        <device Dname="EFM32LG390F64">
          <compile header="Device/SiliconLabs/EFM32LG/Include/em_device.h"  define="EFM32LG390F64"/>
          <debug      svd="SVD/EFM32LG/EFM32LG390F64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00010000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32LG.FLM"  start="0x00000000"  size="0x00010000"  default="1"   style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00010000"  default="0"   style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFM32LG395">
        <book         name="Documents/efm32lg-datasheet.pdf"      title="EFM32LG395 Data Sheet"/>
        <book         name="Documents/efm32lg-errata.pdf"         title="EFM32LG395 Errata"/>
        <!-- *************************  Device 'EFM32LG395F128'  ***************************** -->
        <device Dname="EFM32LG395F128">
          <compile header="Device/SiliconLabs/EFM32LG/Include/em_device.h"  define="EFM32LG395F128"/>
          <debug      svd="SVD/EFM32LG/EFM32LG395F128.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32LG.FLM"  start="0x00000000"  size="0x00020000"  default="1"   style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00020000"  default="0"   style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32LG395F256'  ***************************** -->
        <device Dname="EFM32LG395F256">
          <compile header="Device/SiliconLabs/EFM32LG/Include/em_device.h"  define="EFM32LG395F256"/>
          <debug      svd="SVD/EFM32LG/EFM32LG395F256.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00040000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32LG.FLM"  start="0x00000000"  size="0x00040000"  default="1"   style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00040000"  default="0"   style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32LG395F64'  ***************************** -->
        <device Dname="EFM32LG395F64">
          <compile header="Device/SiliconLabs/EFM32LG/Include/em_device.h"  define="EFM32LG395F64"/>
          <debug      svd="SVD/EFM32LG/EFM32LG395F64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00010000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32LG.FLM"  start="0x00000000"  size="0x00010000"  default="1"   style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00010000"  default="0"   style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFM32LG840">
        <book         name="Documents/efm32lg-datasheet.pdf"      title="EFM32LG840 Data Sheet"/>
        <book         name="Documents/efm32lg-errata.pdf"         title="EFM32LG840 Errata"/>
        <!-- *************************  Device 'EFM32LG840F128'  ***************************** -->
        <device Dname="EFM32LG840F128">
          <compile header="Device/SiliconLabs/EFM32LG/Include/em_device.h"  define="EFM32LG840F128"/>
          <debug      svd="SVD/EFM32LG/EFM32LG840F128.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32LG.FLM"  start="0x00000000"  size="0x00020000"  default="1"   style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00020000"  default="0"   style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32LG840F256'  ***************************** -->
        <device Dname="EFM32LG840F256">
          <compile header="Device/SiliconLabs/EFM32LG/Include/em_device.h"  define="EFM32LG840F256"/>
          <debug      svd="SVD/EFM32LG/EFM32LG840F256.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00040000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32LG.FLM"  start="0x00000000"  size="0x00040000"  default="1"   style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00040000"  default="0"   style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32LG840F64'  ***************************** -->
        <device Dname="EFM32LG840F64">
          <compile header="Device/SiliconLabs/EFM32LG/Include/em_device.h"  define="EFM32LG840F64"/>
          <debug      svd="SVD/EFM32LG/EFM32LG840F64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00010000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32LG.FLM"  start="0x00000000"  size="0x00010000"  default="1"   style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00010000"  default="0"   style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFM32LG842">
        <book         name="Documents/efm32lg-datasheet.pdf"      title="EFM32LG842 Data Sheet"/>
        <book         name="Documents/efm32lg-errata.pdf"         title="EFM32LG842 Errata"/>
        <!-- *************************  Device 'EFM32LG842F128'  ***************************** -->
        <device Dname="EFM32LG842F128">
          <compile header="Device/SiliconLabs/EFM32LG/Include/em_device.h"  define="EFM32LG842F128"/>
          <debug      svd="SVD/EFM32LG/EFM32LG842F128.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32LG.FLM"  start="0x00000000"  size="0x00020000"  default="1"   style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00020000"  default="0"   style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32LG842F256'  ***************************** -->
        <device Dname="EFM32LG842F256">
          <compile header="Device/SiliconLabs/EFM32LG/Include/em_device.h"  define="EFM32LG842F256"/>
          <debug      svd="SVD/EFM32LG/EFM32LG842F256.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00040000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32LG.FLM"  start="0x00000000"  size="0x00040000"  default="1"   style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00040000"  default="0"   style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32LG842F64'  ***************************** -->
        <device Dname="EFM32LG842F64">
          <compile header="Device/SiliconLabs/EFM32LG/Include/em_device.h"  define="EFM32LG842F64"/>
          <debug      svd="SVD/EFM32LG/EFM32LG842F64.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00010000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32LG.FLM"  start="0x00000000"  size="0x00010000"  default="1"   style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00010000"  default="0"   style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFM32LG880">
        <book         name="Documents/efm32lg-datasheet.pdf"      title="EFM32LG880 Data Sheet"/>
        <book         name="Documents/efm32lg-errata.pdf"         title="EFM32LG880 Errata"/>
        <!-- *************************  Device 'EFM32LG880F128'  ***************************** -->
        <device Dname="EFM32LG880F128">
          <compile header="Device/SiliconLabs/EFM32LG/Include/em_device.h"  define="EFM32LG880F128"/>
          <debug      svd="SVD/EFM32LG/EFM32LG880F128.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00020000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32LG.FLM"  start="0x00000000"  size="0x00020000"  default="1"   style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00020000"  default="0"   style="IAR"/>
        </device>

        <!-- *************************  Device 'EFM32LG880F256'  ***************************** -->
        <device Dname="EFM32LG880F256">
          <compile header="Device/SiliconLabs/EFM32LG/Include/em_device.h"  define="EFM32LG880F256"/>
          <debug      svd="SVD/EFM32LG/EFM32LG880F256.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00040000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/EFM32LG.FLM"  start="0x00000000"  size="0x00040000"  default="1"   style="Keil"/>
          <algorithm  name="Flash/FlashEFM32.flash"  start="0x00000000"  size="0x00040000"  default="0"   style="IAR"/>
        </device>

